[
{
"id": 21,
"slug": "abi-adams",
"full_name": "Abi Adams",
"first_name": "Abi",
"last_name": "Adams",
"email": "abi@abiadams.co.uk",
"phone": "07951 101 049",
"practice": "Movement | Fitness | Self Growth | Wellbeing |",
"location": "Woodford London, Online",
"how": "Location, Online, Home visit",
"available_time": "",
"social_ig": "@abiadams_mma",
"social_tw": "abiadams_mma",
"social_fb": "abiadams MMA",
"short_bio": "Abi’s Sessions:\r\n\r\nOne to one Mixed Moment session : transformational movement coaching\r\n\r\n7 week women’s project, called “Project women” - 7 week online course\r\n\r\nWhat does a session with Abi involve? \r\n\r\n• Light movement so Abi can get a feeling and eye visual of how you are moving and what tension you are holding in the body \r\n• Discussion of your aims and intentions to really hone in on what is at the core of the issue\r\n• Kinesiology, Thai massage and movement disciplines such as yoga and martial arts \r\n• Working with the phycology of energy centres, emotional patterning and physical restrictions\r\n\r\nThis is for you if you’re experiencing:\r\n\r\n• PMS and hormonal issues\r\n• Past Trauma \r\n• Emotional overwhelm \r\n• Undiagnosed physical pain\r\n• Stuckness and boredom in your life (women)",
"bullet_1": "15 + years experience",
"bullet_2": "Insured ",
"bullet_3": "Offering Movement",
"description": "A little bit about Abi:\r\n\r\nAbi had quite a violent experience growing up, which meant she became a huge people pleaser, always trying to make sure her family were ok. Abi had always dreamed of being an actress, but didn’t feel like she could pursue this dream because her family didn’t approve. After years of shrinking to fit in, Abi experienced her first Thai massage, where she realised that touch could actually help the body to feel empowered. This led her down a path of wanting to understand more about the body, so she trained as a yoga teacher in India. She soon realised that she didn’t like the rigidity of yoga so started to explore more fluid forms of movement. Using martial arts, kinesiology, Thai massage and other movement disciplines Abi created her own unique style of movement: Mixed Movement.\r\n\r\nAbi’s mission is to show women who have always been told “No”, how to find their “Yes”.\r\n\r\n3 things about Abi:\r\n\r\n• Her power animals are the wolf, the whale and the eagle \r\n• She loves skinny dipping and feeling at one with nature\r\n• She loves climbing anything that looks climbable! Get out the way kids, Abi’s coming through! \r\n",
"video": "https://www.youtube.com/watch?v=7rGC9qzvbuM",
"profile_picture": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/Abi-Adams.jpg",
"gallery_1": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/Abi-Adams-1.jpg",
"gallery_2": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/abi_adams.jpg",
"gallery_3": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/Abi-Adams.jpg",
"gallery_4": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/15-09-202860-1.jpg",
"testimonial": "I have to say, I was apprehensive ahead of this class. I never normally attend classes like this, I find it really difficult to focus my mind and talking in front of people I don't know is always a struggle for me. However after meeting Abi all my apprehension faded. The guided meditation was beautiful and the perfect start to such a wonderful and eye opening experience. I learned so much about myself and my body. Abi was always happy to listen and give advice. The clue app Abi showed me is incredible and I'm so excited to start using it. Can't recommend this class enough!\r\n\r\nEmma\r\n",
"shopify_id": ""
},
{
"id": 22,
"slug": "agnes-trevillion",
"full_name": "Agnes Trevillion",
"first_name": "Agnes",
"last_name": "Trevillion",
"email": "Agnestrevillionyoga@gmail.com",
"phone": "07928029068",
"practice": "Yoga | Fitness | Pain & Chronic Conditions",
"location": "Hammersmith London, Online",
"how": "Online, Location, Home Visit",
"available_time": "",
"social_ig": "@agnestrevillion",
"social_tw": "",
"social_fb": "",
"short_bio": "Agnes’ Sessions:\r\n\r\n• One-on-One yoga sessions in person and online\r\n• Group Classes\r\n• Pregnancy Yoga\r\n• Power, Yin, and Hatha Yoga\r\n• Rehabilitation yoga for example, people with spinal injuries\r\n• Chair yoga for the elderly or those with disabilities\r\n\r\nWhat does a session with Agnes involve? \r\n\r\nYou will meet at a space near Agnes or at your home. You’ll discuss specific requirements to create a class to cater to your individual needs in a fun way. \r\n\r\nThis is for you if:\r\n\r\n• You’re at any stage of your pregnancy\r\n• You have disabilities\r\n• You’re a teenager",
"bullet_1": "1 + year experience",
"bullet_2": "Fully insured and certified",
"bullet_3": "Offering Yoga",
"description": "A little bit about Agnes:\r\n\r\nAgnes went to her first yoga class when she was 15 and her first impression was that it was a weird, crazy experience and totally out of her comfort zone. From a young age Agnes worked in the corporate world working 80 hour weeks, which ultimately led to burnout. Somehow yoga found it’s way back into Agnes’ life and she started developing her own practice, which always brought her a sense of relief after the stressful days at work. The worse she felt at her job and the better she felt in her yoga practise, the more she wanted to give up the corporate world and dedicate her life to yoga. \r\n\r\nShe was so adamant that she had to follow her dreams as a yoga teacher that she turned down a huge pay rise to stay in her corporate job. She took the leap and decided to dedicate herself to full time teaching. She now shares through her teaching and with her students the powerful message that true happiness is about dedicating our lives to something we truly believe in and to something that uses our special gifts to serve others. \r\n\r\n3 things about Agnes:\r\n\r\n• Her friends say she’s like a ray of sunshine because she’s always smiling\r\n• Even though she’s tiny, she’s constantly hungry and loves snacking any chance she gets \r\n• She’s happiest when barefoot, sandy and sun-kissed \r\n",
"video": " https://www.youtube.com/watch?v=-ao1_PMtXqw",
"profile_picture": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/15-09-203173.jpg",
"gallery_1": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/15-09-203207.jpg",
"gallery_2": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/15-09-203219.jpg",
"gallery_3": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/15-09-203200.jpg",
"gallery_4": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/15-09-203193.jpg",
"testimonial": "Agnes' classes are the best. I've practiced yoga for years and she is definitely my favourite teacher. Her classes are fun and energetic but she also creates such a sense of calm. Her teaching brings the perfect blend of everything I never knew I needed into every class i attend. I always leave feeling like I'm floating.",
"shopify_id": ""
},
{
"id": 23,
"slug": "alex-willis",
"full_name": "Alex Willis",
"first_name": "Alex",
"last_name": "Willis",
"email": "alex.willis.doterra@gmail.com",
"phone": "07957312237",
"practice": "Essential oils Specialist | Wellbeing | General Health | Self Care | Pain & Chronic Conditions",
"location": "Chiswick London, Online",
"how": "Online, location",
"available_time": "",
"social_ig": "@readysteadydo",
"social_tw": "",
"social_fb": "",
"short_bio": "Alex's Sessions:\r\n\r\nMedicinal Grade dōTERRA Essential oils for any imbalance.\r\n\r\nWhat does a session with Alex involve? \r\n\r\nAlex takes a deep dive with you, into where you’re at and what you’re experiencing in your life, both physically and mentally. She then begins discussing and testing different oils to see if they resonate. \r\nSome oils are very specific to condition. Others need to be tested to see if they are well received by your body. The smell needs to resonate with you, so you’ll really feel like you’re creating your own essential oil remedy! \r\n\r\nThis is for you if you’re experiencing:\r\n\r\n• Digestive issues\r\n• Sleep issues\r\n• Pain issues\r\n• Emotional imbalances\r\n• Skin issues\r\n• Menopausal symptoms",
"bullet_1": "4 + years experience",
"bullet_2": "Fully insured and certified",
"bullet_3": "Offering Essential oils",
"description": "A little bit about Alex:\r\n\r\nOriginally from a musical theatre background, Alex’s vision and absolute joy is to see people take responsibility for their own health. As a big feeler with a warm, vibrant personality, Alex has a passion for connecting with people and has been drawn to essential oils because of their amazing immersive qualities. \r\n\r\nAlex is a qualified Aromatherapist and a dōTERRA Essential Oils Expert who is committed to sharing the life-enhancing benefits of therapeutic-grade essential oils with those interested in looking at alternative health solutions. Alex continues to be in awe of the incredible gifts essential oils have to offer and has been using them to support her own health issues with amazing results.\r\n\r\n3 things about Alex:\r\n\r\n• She loves her dog and cat (Eric and Ernie) who also love blissing out on Alex’s oils.\r\n• She hates roller coasters (because they’re dirty!)\r\n• She’s an amazing polonesian dancer! ",
"video": "",
"profile_picture": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/test_naming.jpg",
"gallery_1": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/Alex-Willis15-09-202604.jpg",
"gallery_2": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/Alex-Willis15-09-202606.jpg",
"gallery_3": null,
"gallery_4": null,
"testimonial": "",
"shopify_id": ""
},
{
"id": 48,
"slug": "annabel-james",
"full_name": "Annabel James",
"first_name": "Annabel",
"last_name": "James",
"email": "annabel@mammawellbeing.com",
"phone": "+447818036161",
"practice": "Transformational Breathwork",
"location": "Mexico City",
"how": "1:1",
"available_time": "",
"social_ig": "@annabeljames",
"social_tw": "",
"social_fb": "Annabel James",
"short_bio": "Annabel is passionate about supporting transformation for others, after her own transformational journey.\r\nBreathwork changed her life, healing deep grief after losing her brother. \r\n\r\nWhether you have something you need to address or are looking for motivation, or deep healing, this session is for you. \r\n",
"bullet_1": "5 + years ",
"bullet_2": "Certified ",
"bullet_3": "Breathwork",
"description": "Annabel is passionate about supporting transformation for others, after her own transformational journey.\r\nBreathwork changed her life, healing deep grief after losing her brother. \r\n\r\nWhether you have something you need to address or are looking for motivation, or deep healing, this session is for you. \r\n",
"video": "",
"profile_picture": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/1V8A2177.jpg",
"gallery_1": null,
"gallery_2": null,
"gallery_3": null,
"gallery_4": null,
"testimonial": "Annabel holds a safe loving space.\r\n\r\nCarmella \r\n",
"shopify_id": ""
},
{
"id": 24,
"slug": "aysha-bell",
"full_name": "Aysha Bell",
"first_name": "Aysha",
"last_name": "Bell",
"email": "connect@ayshabell.com",
"phone": "",
"practice": "Sound Healing | Yoga | Self Care | Meditation | Fitness | Wellbeing",
"location": "London, Online",
"how": "E96EU London, E96SG London, W1D4QH London, Online",
"available_time": "",
"social_ig": "@ayshabellwellness",
"social_tw": "",
"social_fb": "",
"short_bio": "Aysha’s Sessions:\r\n\r\n• Sound Healing \r\n• Workshops which include yin, kundalini, vinyasa and sound\r\n• Self massage women’s workshop\r\n\r\nWhat does a session with Aysha involve? \r\n\r\n• Explanation of techniques \r\n• Centering and breathwork/meditation\r\n• Chanting. Seated warm up. \r\n• Vinyasa flow\r\n• Cooling down\r\n• Kundalini Kriyas \r\n• Gong and guided meditation to close\r\n\r\nThis is for you if:\r\n\r\n• You have any kind of stress related issue\r\n• You want to experience a deeper healing in the body\r\n• You want to experience deep relaxation ",
"bullet_1": "4 years + experience",
"bullet_2": "Certified ",
"bullet_3": "Offering Sound healing",
"description": "A little bit about Aysha:\r\n\r\nAs the daughter of a medium and the granddaughter of a medicine woman, Aysha had always felt this yearning to connect to spirit but had let the need for outer fulfillment consume her. Growing up, Aysha had addictive tendencies and a very unhealthy lifestyle. Health concerns meant Aysha had to sell her business and move to a part of London away from her family. Declared bankrupt with no family around, Aysha felt completely lost. She remembers walking around in this weird haze completely disconnected. \r\n\r\nCraving a reconnection with herself and a sense of meaning in her life, Aysha went from yoga studio to yoga studio to find a teacher that could help her connect back to herself. She finally came across an amazing lady at the Refinery in East London, who opened up a whole world for Aysha and inspired her to do a teacher training. From there, Aysha has expanded her practise by learning and training in gong, which she believes helps people connect to the deepest part of themselves. \r\n\r\nAysha has also started a new ‘lock down project’ where she makes meditation gift boxes.\r\n\r\n3 things about Aysha:\r\n\r\n• She loves to have “fashion rave nights” with her daughter at her studio\r\n• She always misses flights\r\n• She sings to her food when she’s cooking and never cooks in a bad mood \r\n",
"video": "",
"profile_picture": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/15-09-203309.jpg",
"gallery_1": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/15-09-203282.jpg",
"gallery_2": null,
"gallery_3": null,
"gallery_4": null,
"testimonial": "Online Gong and Guided Meditation: You filled me with so much love, I released anxiety and fear but felt full of love. I cried but felt euphoric by the end of the session. Thank you so much for doing this.\r\n\r\n- Sarah, Sweden",
"shopify_id": ""
},
{
"id": 25,
"slug": "debbie-slater",
"full_name": "Debbie Slater",
"first_name": "Debbie",
"last_name": "Slater",
"email": "keheren@gmail.com",
"phone": "07961 818688",
"practice": "Massage Therapy | Pain & Chronic Conditions | Wellbeing | General Health ",
"location": "Twickenham  London",
"how": "1:1, Home visit",
"available_time": "",
"social_ig": "@keherentherapy",
"social_tw": "https://twitter.com/keherentherapy",
"social_fb": "https://www.facebook.com/keherentherapylondon/",
"short_bio": "Debbie’s Sessions:\r\n\r\nKeheren Therapy \r\n\r\nWhat does a session with Debbie involve?\r\n\r\nDebbie uses a massage system called hydrotherm, where warm water-filled cushions are placed over the massage table, allowing you to lay face up during the whole massage. You won’t need to roll over half way through like with other styles of massage… and you’ll still receive a blissful top to toe experience! \r\n\r\nThis is for you if:\r\n\r\n• You’re at any stage of your pregnancy\r\n• You’re on cancer treatment \r\n• You can’t lie on your front due to surgery, injury or disabilities\r\n• You want to de-stress!\r\n• Want sports massage or relief of muscular aches and pains.",
"bullet_1": "13 + years experience",
"bullet_2": "Fully insured and certified",
"bullet_3": "Offering Keheren therapy",
"description": "A little bit about Debbie:\r\n\r\nAs an avid traveller who spent many years travelling the world with a backpack on her back, Debbie started experiencing serious back problems. After many failed attempts at trying out various therapies to heal her back problems, one day, her Dad suggested that she visit a massage therapist who was offering a very unique kind of therapy: Hydrotherm Massage. \r\n\r\nTo Debbie’s utter relief and amazement, Hydrotherm Massage actually cured her back problems! She was so surprised at her remarkable improvement that she was eager to learn everything about this therapy.\r\n\r\n As synchronicity would have it, the therapist that cured Debbie of her back pain saw such potential in her that he offered her a position working as his apprentice. This meant that Debbie had the opportunity to delve deep into learning and practising this special technique. 13 years later, Debbie has now taken over the business and has clinics in both Richmond-upon-Thames and Truro (keheren therapy - translated from the Cornish language to mean muscle therapy).\r\n\r\nTo repay the kind gesture that was given to her by her massage therapist, she now trains and takes on new massage therapists. \r\n\r\n3 things about Debbie:\r\n\r\n• She used to have huge poster of Nick Kershall (the 80s heartthrob) by her bed\r\n• She loves roller skating \r\n• She hates cucumber \r\n",
"video": "",
"profile_picture": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/aver.jpg",
"gallery_1": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/Debbie-Slater29.jpg",
"gallery_2": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/Debbie-Slater7-1.jpg",
"gallery_3": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/Debbie-Slater29-1.jpg",
"gallery_4": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/aver.jpg",
"testimonial": "Debbie's massages are legendary, and it is always a treat to book in. She is friendly, warm-hearted, and an expert in her field. Not only are the massages brilliantly relaxing, but they are also great at keeping on top of any little physical niggles so that I can continue enjoying various activities without being hampered by injury. The fact that Debbie is also medically trained means that I feel completely safe in her hands. I would recommend everyone to try a keheren therapy massage!",
"shopify_id": ""
},
{
"id": 26,
"slug": "emma-arden",
"full_name": "Emma Arden",
"first_name": "Emma",
"last_name": "Arden",
"email": "queenofnarnia59@hotmail.com",
"phone": "07956 690 271",
"practice": "Emotional Freedom Technique | Reiki | Talk Therapy | Detoxing & Nutritional Therapy | Spiritual Growth | Self Care | Wellbeing | Meditation",
"location": "Online",
"how": "Online",
"available_time": "",
"social_ig": "ela_nedra",
"social_tw": "ArdenNatHealth",
"social_fb": "ArdenNaturalHealth",
"short_bio": "Emma’s Sessions: \r\n\r\nTune In & Power-Up with Emma:\r\n\r\n• Power-Up - Talk therapy, EFT, Reiki, Breathwork\r\n• Clean-Up - Detox, Cleansing, Digestion support\r\n• 7 Day Detox - Includes a day to day plan, recipes, supplements, herbs\r\n• Skill Up - Reiki Master Teacher | Guided Meditations |\r\n Native American medicine wheel space clearing plus more\r\n• Tune In - 'Find Your Voice' by using all my skills in my toolbox, I'll help you find your mojo and creative passion again.\r\n\r\nWhat does a session with Emma involve? \r\n\r\nOnline sessions\r\n\r\n• Clean-Up: You will have the opportunity to go through what ailments you're experiencing. For physical/health related guidance - diet and supplement recommendations are offered\r\n• Power-Up: For emotional guidance - various techniques and practises are offered to get to the core of your issues\r\n\r\nThis is for you if:\r\n\r\nYou’re stuck - whether it’s career, relationship, confidence, negative patterns, lack of confidence, lack of mojo, or you’re feeling overwhelmed.",
"bullet_1": "20 + years experience",
"bullet_2": "Fully insured and certified",
"bullet_3": "Offering EFT and Reiki",
"description": "<p>A little bit about Emma: \r\n\r\nIn a time when Emma experienced a breakdown, her mum recommended she try reiki. It was the first time in her life where she had that feeling that she had ‘come home’. She discovered a sense of relief, pressing pause to heal. \r\n\r\nEmma finally began to find a community of people who understood her and who created a platform where she could have a voice. She trained as a reiki master and teacher, while her fascination continued to grow, leading her to study other kinds of energy and bodywork modalities. Wanting to explore more about how to keep the body in balance, she went to Thailand to train in Thai massage and detoxing. \r\n\r\nParalleled with her own inner work and healing path, Emma has made a career out of her passion: singing. She has now released 5 singles which have been played on Radio 6 and the BBC. While it took some time to really allow herself to be everything she wanted to be, she now wants to inspire other women to follow their dreams. \r\n\r\n3 things about Emma: \r\n\r\n• She used to play the clarinet \r\n• She likes to pretend she’s a hip hop dancer \r\n• She gets told by her friends that she talks too much</p>",
"video": "'Eradicate the N0':  https://youtu.be/qUMGNQ-q8jM",
"profile_picture": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/15-09-203397.jpg",
"gallery_1": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/15-09-203413-1.jpg",
"gallery_2": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/Debbie-Slater29-1.jpg",
"gallery_3": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/15-09-203397.jpg",
"gallery_4": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/15-09-203413-2.jpg",
"testimonial": "Every time I have an EFT sesh with Emma, it feels like a giant exhale of relief. Yeah, it’s intense, but so worth it. And somehow, she always manages to make me laugh through my tears.\r\n\r\nJackie\r\n",
"shopify_id": ""
},
{
"id": 27,
"slug": "fiona-austin",
"full_name": "Fiona Austin",
"first_name": "Fiona",
"last_name": "Austin",
"email": "fiona@bmcc.biz",
"phone": "+447930351068",
"practice": "Positive Psychologist and Health Coach | Talking Therapy | Hypnotherapy | Relationships | Self Growth | Wellbeing",
"location": "Notting Hill London, Online",
"how": "Online, location",
"available_time": "",
"social_ig": "morethanjustlistening",
"social_tw": "",
"social_fb": "",
"short_bio": "Fiona’s Sessions:\r\n\r\nSpecialising in anxiety - in your career, your life and your future. \r\n\r\nWhat does a session with Fiona involve? \r\n\r\nFiona will find out what made you reach out and what exactly you need clarity on. Using various tools, questions along with an understanding of your body and how it influences your mind.  \r\n\r\nFiona helps you unravel what is at the core of your anxiety, to interpret it's message, hear it and let it go!\r\n\r\nThis is for you if you:\r\n\r\n• Want to feel good about your life.\r\n• Feel the onset of seasonal affective disorder \r\n• Have Covid Blues\r\n• Struggle with insomnia\r\n• Have anxiety about a relationship breakup or being single \r\n• Feel isolated or disconnected\r\n• Have Post Natal Anxiety or Depression\r\n• Are sick of jumping from Screen to Screen - Zoom Fatigue!  \r\n                       ... Just want to talk ... ",
"bullet_1": "19 + years experience",
"bullet_2": "Fully insured and certified",
"bullet_3": "Offering Coaching",
"description": "A little bit about Fiona:\r\n\r\nTwenty years ago saw Fiona move from the world of music journalism to becoming a counsellor and psychotherapist going from a career of crafting a story to one where she now unravels the stories of people's life - creating a real and positive way forward.  \r\n\r\nShe was first introduced to the world of psychology and the power of the mind after reading Paul Mckenna’s autobiography, which spoke about the dynamics of hypnosis. But once she delved into this world of the mind, she realised that people need more than a formula to be understood enough to let go and move forward.  \r\n\r\nUltimately, she qualified in complementary health care and psychological perspectives where she combines the consideration of your emotions not just from the perspective of your mind, but also your environment and how you are within yourself and your health.\r\n\r\nFiona lived for many years with her family in Spain and worked in Gibraltar in a high profile practice. Whilst living abroad she developed an outdoor integration of psychology called Nature Sense which is about 'Going outside to heal Inside'. She also trains therapists of all disciplines to take their therapies outside.\r\n\r\nAside from her traditional practice in the Notting Hill area Fiona enjoy's going for a walk with her dog every day.  \r\n\r\n3 things about Fiona:\r\n\r\n• She’s an expert biohacker!\r\n• She loves walking barefoot\r\n• Her children tell her that she talks too much to the dog",
"video": "",
"profile_picture": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/IMG_8320.jpg",
"gallery_1": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/IMG_8342.jpg",
"gallery_2": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/IMG_8378.jpg",
"gallery_3": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/IMG_8362.jpg",
"gallery_4": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/IMG_8317.jpg",
"testimonial": "I found Fiona to be both friendly and professional. She was so easy to talk to and non judgemental. Fiona has helped me through a tough time and I m very thankful.\r\n\r\nSue Mamma client  ",
"shopify_id": ""
},
{
"id": 47,
"slug": "francisco-calles",
"full_name": "Francisco Calles",
"first_name": "Francisco",
"last_name": "Calles",
"email": "f.j.amoscotegui@gmail.com",
"phone": "07541493762",
"practice": "Sound Healing | Gong Bath | Meditation | Spiritual Growth | Wellbeing",
"location": "Home visits",
"how": "Home visits",
"available_time": "",
"social_ig": "toestocrown",
"social_tw": "",
"social_fb": "",
"short_bio": "Francisco’s Sessions:\r\n \r\n\r\nOne-on-One or Group Sound Healing and Gong Bath\r\n\r\n\r\n\r\nWhat does a session with Francisco involve? \r\n\r\n• Lying down in a comfortable position underneath a blanket so you feel very held. ",
"bullet_1": "17 + years experience",
"bullet_2": "Certified, insured ",
"bullet_3": "Offering Sound healing ",
"description": "A little bit about Francisco:\r\n\r\nGrowing up, Fransico’s father played a lot of flamenco guitar and developed a deep passion for music. The first sound healing session he went to got him absolutely hooked and it was from that moment that he realised he could access a deep, meditative space more powerfully than any other practise. It was where he felt a true connection to himself. From there, Francisco went on to experiment with different qualities of sound and discovered how different frequencies of sound alter different frequencies in the body. \r\n\r\n3 things about Francisco:\r\n\r\n• He used to love cooking until he worked in a kitchen. Now he only cooks the most quick and simple meals he can!\r\n• He loves listening to Disney songs (but don’t tell anyone!)\r\n• He hates aubergines and okra  ",
"video": "",
"profile_picture": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/15-09-203043.jpg",
"gallery_1": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/15-09-202948.jpg",
"gallery_2": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/15-09-202945.jpg",
"gallery_3": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/15-09-202943.jpg",
"gallery_4": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/15-09-202898.jpg",
"testimonial": "",
"shopify_id": ""
},
{
"id": 30,
"slug": "ged-ferguson",
"full_name": "Ged Ferguson",
"first_name": "Ged",
"last_name": "Ferguson",
"email": "ged@gedferguson.com",
"phone": "07771364658",
"practice": "5 Element Acupuncture | Cranio-Sacral Therapy | Pain & Chronic Conditions | General Health | Wellbeing",
"location": "Kensington London",
"how": "1:1",
"available_time": "",
"social_ig": "ged.ferguson",
"social_tw": "",
"social_fb": "",
"short_bio": "Ged’s Sessions:\r\n\r\n• 5 Elements acupuncture - the most ancient form of acupuncture that follows the the Chinese theory that we are all made up of 5 elements - Earth, Fire, Water, Metal and Wood. These elements represent our creative energies that should all ideally be in balance. \r\n• Energy centre readings and rebalancing.\r\n• Biodynamic craniosacral therapy.\r\n\r\nWhat does a session with Ged involve? \r\n\r\nAn initial consultation which involves quite a lot of talking to identify the emotional elements that need help or support. You will then lie on a massage table where you will have some cranial work. Ged will access the nervous system, looking for energetic blocks. \r\n\r\nThis is for you if:\r\n\r\n• You’re experiencing stress related issues\r\n• You’re looking for change but feel like you can’t because of your life situation\r\n• You need help translating what your body is telling you to do because of a condition you’re experiencing \r\n• You need to create space to receive newness ",
"bullet_1": "9 + years experience ",
"bullet_2": "Certified, insured ",
"bullet_3": "Offering 5 Element Acupuncture",
"description": "A little bit about Ged:\r\n\r\nAfter 20 years working in the shipping industry, Ged realised it just wasn’t fulfilling him anymore. He had got to a point where he had no idea what he was doing with his life. Then, one night on a lads night out, a friend of Ged’s gave him the number of a therapist. He went to the session not knowing anything about it or what to expect. Little did he know that this session would change his life forever and lead him down an unexpected path. \r\n\r\nThis life changing session was 5 elements acupuncture. The moment the first needle was inserted, Ged felt like a veil had been lifted. He walked out onto the street and saw things from a whole new perspective. Three weeks later Ged committed to a three and half year degree in acupuncture alongside his job in the shipping industry. As soon as he qualified, he packed in his old life to live a life fully dedicated to his path as a 5 element acupuncturist. \r\n\r\n3 things about Ged:\r\n\r\n• He’s recently left the city and moved to Kent and bought a paddle board\r\n• He loves bluegrass music\r\n• He’s passionate about football\r\n",
"video": "",
"profile_picture": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/aca.jpg",
"gallery_1": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/15-09-203448.jpg",
"gallery_2": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/15-09-203426-3.jpg",
"gallery_3": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/15-09-203448.jpg",
"gallery_4": null,
"testimonial": "Ged is the most incredible healer. He is so intuitive and on point! During our session delivered the exact Pearl of wisdom I needed to hear in order to see the situation in a new perspective. His distant healing is just as powerful as in person. I felt waves of energy running through my body, I felt so supported and empowered and back in centre. I’m so grateful for all the work Gedi offers. He is a true master Gedi!",
"shopify_id": ""
},
{
"id": 31,
"slug": "hannah-dsouza",
"full_name": "Hannah D'Souza",
"first_name": "Hannah",
"last_name": "D'Souza",
"email": "hdesouza1992@gmail.com",
"phone": "",
"practice": "CBT therapist | Talking Therapy | Relationships | Wellbeing | Self Growth | General Health",
"location": "SW12 9RZ London, SW11 1EH London, Online",
"how": "Location, online",
"available_time": "",
"social_ig": "",
"social_tw": "",
"social_fb": "",
"short_bio": "Hannah’s Sessions:\r\n\r\nIntricate psychotherapy which includes a variety of different approaches including:\r\n\r\n• Compassion Focused Therapy \r\n• CBT\r\n• Attachment Therapy\r\n• Humanistic Person Centred Therapy \r\n \r\nWhat does a session with Hannah involve? \r\n\r\n• Clearing negative thoughts and behaviors, replacing them with healthy ones \r\n• Exploring past experiences and relationships, which have caused certain beliefs \r\n• Rebuilding self-worth\r\n• Developing self-soothing capabilities \r\n• Developing compassionate capabilities \r\n\r\nThis is for you if:\r\n\r\n• You’ve experienced past trauma\r\n• You’re struggling with self worth\r\n• You’re struggling with negative thoughts and habits",
"bullet_1": "3 + years experience",
"bullet_2": "Fully insured and certified",
"bullet_3": "Offering CBT therapy ",
"description": "A little bit about Hannah: \r\n\r\nHannah is a people-person, so she was naturally fascinated with the human mind, social behaviour and human development. But, it wasn’t until she studied Psychology at University that she really realised the importance of talking therapy and the opportunity for a career in it. \r\n\r\nAt school, Hannah was always getting told off for talking too much, and now she has found a way to really use what came so naturally to her to help others: talking! It was a lightbulb moment to discover this kind of communication. \r\n\r\nWhen Hannah started working with her own therapist, she realised that not all therapy was for everyone, so she began to explore the different approaches. Leaning on her own experiences and journey trying different types of therapy, Hannah incorporates all of these various techniques and practises in her one-to-one sessions. \r\n\r\nFun fact about Hannah:\r\n\r\n• She’s a brilliant piano and flute player!",
"video": "",
"profile_picture": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/Hannah-Therapist15-09-203063.jpg",
"gallery_1": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/Hannah-Therapist15-09-203127.jpg",
"gallery_2": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/Hannah-Therapist15-09-203137.jpg",
"gallery_3": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/Hannah-Therapist15-09-203073.jpg",
"gallery_4": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/Hannah-Therapist15-09-203156.jpg",
"testimonial": "I have had therapy in the past but never really felt at ease with whom I am speaking with. Hannah made me feel safe at once, and I found I could not stop talking once I got started. The tools I have taken away have helped me understand why I am the person I am today. I have also learnt to set healthy boundaries, step out of my family drama triangle and let go of the resentment of a past traumatic relationship. Thank you Hannah! \r\n\r\nJessica - Mamma client ",
"shopify_id": ""
},
{
"id": 32,
"slug": "kapil-gupta",
"full_name": "Kapil Gupta",
"first_name": "Kapil",
"last_name": "Gupta",
"email": "kapil@nibana.life",
"phone": "0775139753",
"practice": "Life coach | Self Growth | Relationships",
"location": "Online",
"how": "1:1, group, classes",
"available_time": "",
"social_ig": "kapsgupta",
"social_tw": "",
"social_fb": "",
"short_bio": "Kapil’s Sessions:\r\n\r\nNibana.life’s programs\r\n\r\n• Online one-on-one coaching for at least 3 months to get the transformation you’re looking for \r\n• 7 week foundation program for successful professionals that feel stuck in life\r\n• Daily meditation practice groups\r\n• Men’s coaching\r\n\r\nWhat does a session with Kapil involve? \r\n\r\n• Introspection and identity work: inner child, boundaries, victim consciousness\r\n• Clearing of past experiences\r\n• Develop tools that can be integrated on your own \r\n\r\nThis is for you if:\r\n\r\n• You’re a professional who has been running after success and money and now feel stuck, and are questioning - “what now?”\r\n• You’re in a relationship and want to have more or an authentic way of relating to each other. \r\n• You want to become the best version of yourself\r\n• You’re a man who wants to regain your personal power",
"bullet_1": "6 + years experience",
"bullet_2": "",
"bullet_3": "Offering Coaching ",
"description": "A little bit about Kapil:\r\n\r\nOriginally from a corporate background where he was constantly running after money, success and achievement, Kapil believed that once he had these things he would be happy. After separating from his 11 year marriage he moved to London where he lived the bachelor life partying 5 nights a week. He didn’t know what else to do with all the money he was making.\r\n\r\nBut despite always having people around him he felt a complete disconnection from people. He remembers thinking, “there must be more to life than this!”. He had everything he thought would make him happy - the money, the success, the marriage, but he felt so unfulfilled. Wanting to learn how to have a healthy, happy relationship, and to find a sense of meaning in his life, Kapil went on a journey of, “who am I?” He began to realise that he had been suppressing his feelings in order to be successful and had been avoiding connecting to a deeper, more heart centred place in himself.\r\n\r\nHe has since created a company called Nibana.life, which helps men and women connect more deeply to themselves and really live and communicate from an authentic place.\r\n\r\n3 things about Kapil:\r\n\r\n• He’s a great salsa dancer!\r\n• He likes to provoke people so they can reach their potential\r\n• He’s a sensitive guy who enjoys watching romantic comedies\r\n",
"video": "",
"profile_picture": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/aca2-1.jpg",
"gallery_1": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/IMG_8273.jpg",
"gallery_2": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/IMG_8277.jpg",
"gallery_3": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/aca2-1.jpg",
"gallery_4": null,
"testimonial": "",
"shopify_id": ""
},
{
"id": 38,
"slug": "lauren-holmes",
"full_name": "Lauren Holmes",
"first_name": "Lauren",
"last_name": "Holmes",
"email": "hello@lolaholmes.com",
"phone": "07533763907",
"practice": "Theta healer ",
"location": "Mexico, Online",
"how": "Online, 1:1",
"available_time": "",
"social_ig": "laurenpholmes",
"social_tw": "",
"social_fb": "",
"short_bio": "A little bit about Lauren:\r\n\r\nLorem ipsum dolor sit amet, consectetur adipiscing elit. Aliquam et lectus metus. Quisque ac placerat eros. Sed scelerisque consectetur lacus. Cras maximus turpis ut ullamcorper gravida. Mauris tellus risus, ornare ac euismod tincidunt, sollicitudin ac lacus. Suspendisse semper justo quam, a viverra augue interdum sed. Nulla ultricies sollicitudin augue ac finibus.",
"bullet_1": "",
"bullet_2": "Theta healer ",
"bullet_3": "Certified ",
"description": "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Aliquam et lectus metus. Quisque ac placerat eros. Sed scelerisque consectetur lacus. Cras maximus turpis ut ullamcorper gravida. Mauris tellus risus, ornare ac euismod tincidunt, sollicitudin ac lacus. Suspendisse semper justo quam, a viverra augue interdum sed. Nulla ultricies sollicitudin augue ac finibus.\r\n\r\nNullam pretium, nibh cursus accumsan pulvinar, nibh justo ultrices lacus, eu tincidunt quam justo et ligula. Aenean blandit arcu a varius faucibus. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Quisque nisl massa, pulvinar et condimentum nec, posuere nec sem. Duis sagittis leo nec est tincidunt vehicula. Donec auctor nunc rhoncus, malesuada ligula sed, scelerisque justo. Maecenas porta magna nec enim tristique, nec iaculis ex hendrerit. Phasellus rutrum ex sit amet diam semper, non interdum nulla dignissim.\r\n\r\nNunc ut diam nibh. Praesent posuere vulputate urna, nec faucibus neque vehicula in. Aenean ac accumsan dui. Aenean dictum ultrices metus, id iaculis sapien bibendum at. Aenean at erat non augue scelerisque aliquam non in justo. Praesent sit amet ante suscipit, lacinia nisi vel, gravida est. Maecenas sit amet nunc et massa viverra congue. Lorem ipsum dolor sit amet, consectetur adipiscing elit.\r\n\r\nAenean accumsan aliquam dui. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Nam magna tortor, vestibulum sed malesuada id, euismod vel justo. Donec ornare molestie ipsum, id bibendum erat feugiat eget. Maecenas mauris leo, interdum at neque vitae, ultricies fringilla augue. Aliquam laoreet varius eros a vehicula. Morbi ut lorem a sapien hendrerit aliquet eget non nunc. Duis lacus elit, sollicitudin ac laoreet in, vulputate sed tellus. In congue ac felis eget fringilla. Quisque aliquet facilisis dictum. Aenean mattis augue id posuere elementum. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Integer rutrum, libero quis dapibus lacinia, diam odio fermentum tortor, eget dapibus nisi ante non orci. In placerat ante vitae velit blandit vehicula. Pellentesque sagittis nibh at orci euismod, a vestibulum sem vulputate. Donec id imperdiet ligula.",
"video": "",
"profile_picture": "https://joinmamma.com/wp-content/uploads/2020/10/IKE1929.jpg",
"gallery_1": "https://joinmamma.com/wp-content/uploads/2020/10/IKE1995.jpg",
"gallery_2": "https://joinmamma.com/wp-content/uploads/2020/10/IKE2063.jpg",
"gallery_3": "https://joinmamma.com/wp-content/uploads/2020/10/IKE4948.jpg",
"gallery_4": "https://joinmamma.com/wp-content/uploads/2020/10/IKE5103.jpg",
"testimonial": "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Aliquam et lectus metus. Quisque ac placerat eros. Sed scelerisque consectetur lacus. Cras maximus turpis ut ullamcorper gravida. Mauris tellus risus, ornare ac euismod tincidunt, sollicitudin ac lacus. Suspendisse semper justo quam, a viverra augue interdum sed. Nulla ultricies sollicitudin augue ac finibus.",
"shopify_id": ""
},
{
"id": 34,
"slug": "magda-weglowskaoliveira",
"full_name": "Magda Oliveira",
"first_name": "Magda",
"last_name": "Weglowska-Oliveira",
"email": "magda.olive@hotmail.co.uk",
"phone": "07877989381",
"practice": "Massage Therapy | Reflexology | Pain & Chronic Conditions | Self Care | General Health | Wellbeing",
"location": "Home Visits London",
"how": "Home Visits",
"available_time": "",
"social_ig": "",
"social_tw": "",
"social_fb": "",
"short_bio": "Magda’s Sessions:\r\n\r\n• Aromatherapy Massage\r\n• Deep Tissue \r\n• Holistic Massage\r\n• Back, Neck and Shoulders\r\n• Hawaiin: (ultra relaxing and works with the wave of the ocean)\r\n• Sports Massage\r\n• Reflexology\r\n• Pregnancy Massage \r\n• Special Women’s Massage \r\n\r\nWhat does a session with Magda involve? \r\n\r\n• Everything is tailored to the individual. \r\n• Magda tunes into what you need provides a safe space for you to feel completely at peace.\r\n\r\nThis is for you if you’re experiencing:\r\n\r\n• Aches and pains\r\n• Emotional stress\r\n• Digestion issues\r\n• Fertility issues\r\n• Menopausal symptoms",
"bullet_1": "10+ years experience",
"bullet_2": "Fully insured and certified",
"bullet_3": "Offering Massage therapy",
"description": "A little bit about Magda:\r\n\r\nMagda never thought she’d be one to enjoy a massage. Then 18 years ago, she decided to leave her job as a teacher in Poland to move to London, she completely fell in love with this vibrant and diverse city. She felt a sense of freedom that she had never felt before. One day, someone in her shared house organised a women’s support group. This is where she met a reiki master who changed her life forever.\r\n\r\nAfter experiencing the relaxation and benefits of massage, it felt so natural to her that the reiki master encouraged her to train as a massage therapist. \r\nSince then, Magda has trained in various types of massage from Sports Massage and Deep Tissue, Holistic Massage, Aromatherapy, Reflexology, Pregnancy treatments, Ayurvedic Body, Head and Face massage, Lymphatic Drainage and many more. She loves supporting others in their journeys by relieving muscular tension and alleviating other symptoms through a holistic practice backed by science.\r\n\r\n3 things about Magda:\r\n\r\n• She was a proper history nerd at school\r\n• She loves the latin culture and finds Spanish the most romantic and             beautiful language she’s ever heard\r\n• Her happy place is eating a coconut curry watching a beautiful sunset\r\n",
"video": "",
"profile_picture": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/Magda-Massage-Therapy15-09-202736.jpg",
"gallery_1": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/15-09-202744.jpg",
"gallery_2": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/15-09-202740.jpg",
"gallery_3": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/15-09-202753-1.jpg",
"gallery_4": null,
"testimonial": "I have been having massage treatments with Magda for the last 5 years, it is such a treat! I feel amazing after each session.\r\n\r\nKristy\r\n\r\nI used to suffer from stress related insomnia for 3 years. After just one session of Reflexology with Magda, I have slept peacefully through the night. I couldn’t believe it. Thank you so much Magda!  \r\n\r\nHelen",
"shopify_id": ""
},
{
"id": 20,
"slug": "natalie-marsland",
"full_name": "Natalie Marsland",
"first_name": "Natalie",
"last_name": "Marsland",
"email": "natalie@reubenfeels.com",
"phone": "07824884897",
"practice": "Movement & Dance | Fitness",
"location": "Online",
"how": "Online",
"available_time": "",
"social_ig": "natalie_k_marsland",
"social_tw": "",
"social_fb": "natalie_k_marsland",
"short_bio": "Natalie’s Sessions:\r\n \r\n• Groovement Group Practice - a groovy, playful, enriching movement practice that brings awareness into the body and releases tension in a fun playful way. \r\nGroovement is an explorative, free movement, conscious movement practice. \r\n\r\nWhat does a session with Natalie involve? \r\n\r\nMusic curated to fit the tone of the class. Natalie then guides you to engage with your environment and with the others in the group. Through her guidance and chosen music, you will reconnect back to that playful, childish part of you who is not afraid to let go and be silly.\r\n\r\nThis is for you if:\r\n\r\n• You want to get in touch with your body and be more playful\r\n• You need to spice up and inject some energy into your office environment \r\n• You want to bring back the fun into your life",
"bullet_1": "6 years + experience",
"bullet_2": "Fully insured and certified",
"bullet_3": "Offering Groovement",
"description": "A little bit about Natalie:\r\n\r\nGrowing up watching classic 1940s black and white musicals, Natalie always had a passion for musical theatre. This passion led her to create her very own theatre company with one of her very good friends. \r\n\r\nNatalie’s theatre company, “Reuben Feels”, was created with the intention of getting people in touch with the childlike part of themselves that just wants to play. Natalie says that “Reuben” represents the child in all of us. \r\n\r\nDuring the many hours in rehearsal, Natalie found that she was beginning to develop a free flowing movement practise that she used to help actors get out of their heads and into their bodies. It was such a powerful playful practise that she decided to give it its own name - Groovement. \r\n\r\n3 things about Natalie:\r\n\r\n• She finds laundrettes really romantic because you never know who you’re gonna meet\r\n• She’s a coffee snob! \r\n• Her favourite person is her daughter Talulah  ",
"video": "",
"profile_picture": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/NKM_Headshot-Reuben-Feels.jpg",
"gallery_1": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/Natalie-Movement15-09-202645.jpg",
"gallery_2": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/6bbd9735-92bf-48c8-97d3-bd66b60359ef.jpeg",
"gallery_3": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/Natalie-Movement15-09-202663-1.jpg",
"gallery_4": "cdn.shopify.com/s/files/1/0459/1697/9349/t/1/assets/Natalie-Movement15-09-202656.jpg",
"testimonial": "I have always avoided dance classes as I get inside my own head and am so worried I will be judged. I had such a great time in Groovement and did not feel self conscious once...... totally freeing experience.\r\n\r\nJessica ",
"shopify_id": ""
},
{
"id": 45,
"slug": "violet-monis",
"full_name": "Violet Monis",
"first_name": "Violet",
"last_name": "Monis",
"email": "violetmonis@gmail.com",
"phone": "+447860127172",
"practice": "Yoga | Pilates | Mindfulness & Meditation | Movement | Fitness",
"location": "London, Online",
"how": "Online, 1-1, Classes",
"available_time": "",
"social_ig": "violetmonisyoga",
"social_tw": "",
"social_fb": "Violet Monis Yoga",
"short_bio": "Violet's Sessions:\r\n\r\n• One-on-One fitness sessions in person and online\r\n• Group Online Classes\r\n• Power, Yin, Hatha, Budokon yoga and Pilates\r\n• Strength, Mobility and Animal Flow\r\n• Breathwork, Restorative and Meditation classes\r\n\r\nWhat does a session with Violet involve? \r\n\r\n• Accessible Class options available for varying levels in Yoga, Pilates, Strength and Mobility and Animal Flow\r\n• Guidance, modification and support throughout sessions \r\n• Playful energetic sessions, helping to bring out the child in you while respecting your limitations without judgement\r\n\r\nThis is for you if:\r\n\r\n• You want to build strength and mobility\r\n• You feel plateaued or stuck in your fitness journey - no matter your age!\r\n• You are looking for a fun yet rewarding practice\r\n",
"bullet_1": "10 + years ",
"bullet_2": "Certified, insured ",
"bullet_3": "Yoga, Pilates and Movement",
"description": "A little bit about Violet:\r\n\r\nGrowing up in South India, yoga was an integral part of her everyday life from childhood. Though she did carry general fitness habits into her later life, she only came back to yoga after suffering from chronic back pain during her time working as a Bollywood Fashion Designer, spending long busy hours on her feet. \r\nViolet went deeper into her yoga practice and the all-round benefits she received inspired her to pursue teaching so she could share her experience with others. Through fitness and a healthy lifestyle, Violet feels more youthful now in her fifties than she did in her younger years.\r\n\r\nAs well as helping others, practising yoga and pilates has also improved both her physical and mental health. Violet is passionate about making a difference in people's lives and believes that her Indian background and deep cultural knowledge in this field allows her to bring an authentic approach to teaching.\r\n\r\n3 things about Violet:\r\n\r\n• She can speak over 10 languages\r\n• She's lived in over 10 different countries\r\n• She is Happiest while hiking, high up in the mountains\r\n",
"video": "",
"profile_picture": "https://joinmamma.com/wp-content/uploads/2020/11/e3761d51-5da2-469f-b007-124622f0591d.jpeg",
"gallery_1": "https://joinmamma.com/wp-content/uploads/2020/11/647e97f8-1179-4fc9-b37b-1be5772a7025.jpg",
"gallery_2": "https://joinmamma.com/wp-content/uploads/2020/11/4554b413-41fe-4a0d-aed1-5150e84fa981.jpg",
"gallery_3": "https://joinmamma.com/wp-content/uploads/2020/11/violet-p.jpg",
"gallery_4": "https://joinmamma.com/wp-content/uploads/2020/11/de2ab848-514e-4f2b-a591-d70fcf30e4a7.jpeg",
"testimonial": "",
"shopify_id": ""
}
]
